modules/common/src/test/resources/com/l7tech/common/resources/bug3611-signature-inclusive-namespaces.xml

<soapenv:Envelope xmlns:random="http://random.org/some/random/unused/namespace" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-E8836A4D0E69B70A841522185212980113">MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAzMDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTEjeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpWEYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+nQkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y90JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm87TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqidNNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3HUFY09XXtTrXgeOyBUpVlmA=</wsse:BinarySecurityToken><ds:Signature Id="SIG-E8836A4D0E69B70A841522185212981117" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="random soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-E8836A4D0E69B70A841522185212981116"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="random ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>zgyImaL1RhGDeZD0bWpQL/oy540=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>mACdejPxFXf0MMFKPYvoHou4uYvxf58X3olKDQSWV4bacGfDfkNG+gJCEYQwVo67rSoePgarTPdn
PDZm21YV0WMnLq27waBI1gFgc75LtqhyRRn5WrTOgaecvBsD+8rg7U8NyNQwkc2y9pVylC55DWlm
2KoERrxI6VMlxfgT8ks=</ds:SignatureValue><ds:KeyInfo Id="KI-E8836A4D0E69B70A841522185212980114"><wsse:SecurityTokenReference wsu:Id="STR-E8836A4D0E69B70A841522185212980115"><wsse:Reference URI="#X509-E8836A4D0E69B70A841522185212980113" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-E8836A4D0E69B70A841522185212981116" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>