modules/gateway/server/src/test/resources/com/l7tech/server/policy/resources/REQUEST_encryptedusernametoken.xml

<!--
  Request with Encrypted Username Token (for .NET server cert) for Alice/password
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security actor="secure_span" soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp wsu:Id="Timestamp-3-43adcfe1bc059a67b5dae47166cf01e6"><wsu:Created>2009-06-18T16:58:55.573804105Z</wsu:Created><wsu:Expires>2009-06-18T17:03:55.573Z</wsu:Expires></wsu:Timestamp>
            <xenc:EncryptedKey Id="EncryptedKey-0-ee0b81ebd20f9b73a25270bd755f6654" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier></wsse:SecurityTokenReference></dsig:KeyInfo><xenc:CipherData><xenc:CipherValue>f/fcIpgm6vuat1el4JAvzMsYCnhyR0f/YcDcBSQopRrMbaQpJ/nSO4tsEPL1cSSw63KPL7rgITujm8w82FLnT19cjwG/0UKWo+Bgf+oFeJXqExJMFwBJKynLZOvLwuoL3nlTnpn12eZ3SF/UjC8gmgU3nxT6fHObo6hvOUS0Ubw=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey>
            <wssc:DerivedKeyToken wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1" wsu:Id="DerivedKey-Sig-1-9bde704f395506816d2a6e6cc1ef80bc" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wsse:SecurityTokenReference><wsse:Reference URI="#EncryptedKey-0-ee0b81ebd20f9b73a25270bd755f6654" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKeySHA1"/></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>DerivedKey</wssc:Label><wsse:Nonce>YbUQbwEUqXcs6ee1oraQOQ==</wsse:Nonce></wssc:DerivedKeyToken>
            <wssc:DerivedKeyToken wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1" wsu:Id="DerivedKey-Enc-5-34b14c3b65205e71725922734de70db5" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wsse:SecurityTokenReference><wsse:Reference URI="#EncryptedKey-0-ee0b81ebd20f9b73a25270bd755f6654" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"/></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>DerivedKey</wssc:Label><wsse:Nonce>fKRiI1jd4bx6tOtwJxxUDw==</wsse:Nonce></wssc:DerivedKeyToken>
            <xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:DataReference URI="#EncryptedUsernameToken-6-da66f7f954933868f8c6c2659e11f64f"/></xenc:ReferenceList>
            <EncryptedData Id="EncryptedUsernameToken-6-da66f7f954933868f8c6c2659e11f64f" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns="http://www.w3.org/2001/04/xmlenc#"><EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/><dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:Reference URI="#DerivedKey-Enc-5-34b14c3b65205e71725922734de70db5" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk"/></wsse:SecurityTokenReference></dsig:KeyInfo><CipherData><CipherValue>f5f9m/5U4Dl3EP/Xzo1GQESywJFJoRS6gLSidu6docLwYQ+3YvYNHlIxLd2Z2ChDyARJz5Xip8ggyTdZ+pbkg1vSqjdR/9lQc6GL022MA7K6vW4Zf0NE0MkpNz1hQo7v0ViBNtQ4BeJ8pkPp0ouXP1yiXJvhMvzl5a4foJreynKBmXSXNIbP0v/o+6KDa6tTFKt6tmdBuHriuzLiF3/10mtQ4sKvsZPONu0M4ODaFQ2pr5AwIxH/iiQxTGcC11xeNjYC25VM2v1h7VPLBL+sMqF7AWnIYTEIVp0kE4WeC6lxHU6yykR0Y0ntd7Yp5TrZ+D/cxnb1mohmrv4NQIbNsfBXk2auZ332oYDaLpN8VULWxyph3Xj2ZMQyrxR3djD6DgYcW8cce8c9GiS7WdJI/0QrLcuAXdgPDqwep8oKmT7y0I1PSvWyul4v7xh8GcL8x2U21roBn7iFtItowRu4tm4bQF/77ua50H3hslf2MSXBRQkjdS6tRCuPWgjS59fJAOZZ+YK7wgI8OnYLjiTA0Oi+v37tIh5we72rTXP2r/5rU8ep0LaOEXGj9EdBbe6S4t68s4jpwiIvGjzXmZFtyw==</CipherValue></CipherData></EncryptedData>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><ds:Reference URI="#Body-2-ec35db6935cfe4234341064f80ab2f88"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>GXAQQvDGglbG12N0zccDKMGl34A=</ds:DigestValue></ds:Reference><ds:Reference URI="#Timestamp-3-43adcfe1bc059a67b5dae47166cf01e6"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>WZ5jNijcRQc7ri+WSYlg7CI6NA8=</ds:DigestValue></ds:Reference><ds:Reference URI="#UsernameToken-4-0d1154281f02725fe9c6de25c6906e4e"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>Cdhpnj7F6XhPVj0FMraxmLwk7EQ=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>fJZxjwvvaAag4N7V+LvRde0ydqU=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:Reference URI="#DerivedKey-Sig-1-9bde704f395506816d2a6e6cc1ef80bc" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body wsu:Id="Body-2-ec35db6935cfe4234341064f80ab2f88" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
        <tns:listProducts xmlns:tns="http://warehouse.acme.com/ws">
            <tns:delay>0</tns:delay>
        </tns:listProducts>
    </soapenv:Body>
</soapenv:Envelope>